app/Controllers/Produtos.php

    public function list(){
        $data = $this->produtoModel->findAll();
---
SELECT *
FROM `produtos`

    public function produtos($limit){
        $data = $this->produtoModel->findAll($limit);
---
SELECT *
FROM `produtos`
 LIMIT 1

    public function gravarProduto(){
        $this->produtoModel->save([
            'nome' => $this->request->getPost('nome'),
            'valor' => $this->request->getPost('valor')
        ]);
---
INSERT INTO `produtos` (`nome`, `valor`) VALUES ('xbox', '2500')

    public function deletar($id){
        $this->produtoModel->delete($id);
---
DELETE FROM `produtos`
WHERE `id` IN ('4')

    public function atualizar($id){
        $data = $this->request->getJSON();
        $this->produtoModel->update($id, $data);
---
UPDATE `produtos` SET `nome` = 'xbox 360', `valor` = '2500'
WHERE `produtos`.`id` IN ('5')