app/Models/ProdutosModel.php

SELECT *
FROM `produtos`
WHERE `id` = '2'
 LIMIT 1
---
    public function getProduto($id){
        return $this->asArray()->where(['id'=>$id])->first();